In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [10]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 28, 0, 0, 15, 796000), '80', 'paid', None, None, 992, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 28, 0, 3, 40, 796000), '80', 'paid', None, None, 992, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 28, 0, 9, 38, 796000), '80', 'paid', None, None, 992, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 28, 0, 19, 9, 796000), '80', 'paid', None, None, 992, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (5, datetime.datetime(2018, 11, 28, 0, 25, 29, 796000), '80', 'paid', None, None, 992, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"')]

In [11]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('100', 'Adler', 'Barrera', 'M', 'free'),
 ('101', 'Jayden', 'Fox', 'M', 'free'),
 ('13', 'Ava', 'Robinson', 'F', 'free'),
 ('14', 'Theodore', 'Harris', 'M', 'free'),
 ('17', 'Makinley', 'Jones', 'F', 'free')]

In [12]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOUDSGM12AC9618304', 'Insatiable (Instrumental Version)', 'ARNTLGG11E2835DDB9', 0, 266.39628)]

In [13]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('ARNTLGG11E2835DDB9', 'Clp', '', None, None)]

In [14]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 28, 0, 0, 15, 796000), 0, 28, 48, 11, 2018, 2),
 (datetime.datetime(2018, 11, 28, 0, 3, 40, 796000), 0, 28, 48, 11, 2018, 2),
 (datetime.datetime(2018, 11, 28, 0, 9, 38, 796000), 0, 28, 48, 11, 2018, 2),
 (datetime.datetime(2018, 11, 28, 0, 19, 9, 796000), 0, 28, 48, 11, 2018, 2),
 (datetime.datetime(2018, 11, 28, 0, 25, 29, 796000), 0, 28, 48, 11, 2018, 2)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).